                                                   # домашнее задание 1

result = (2 ** 5 + 10) * 3 - 15

print("Результат выражения:", result)

                                             # Домашнее задание номер 2 за 26.04.25

# Запрос данных у пользователя

you_name = input('как вас зовут? ')
yoy_last_name = input("какая ваша фамилия?") # Это не по заданию просто понравилось тема интересная
you_age = input("Сколько вам лет?")
du_you_likes_programming =input('нравится ли вам программировать?')

# Вывод собранных данных
print(' Это ваши данные :')
print(f'Фамилия {yoy_last_name}')
print(f"Имя: {you_name}")
print(f"Возраст: {you_age}")
print(f"Вы любите программировать: {du_you_likes_programming}")

                                 #Задание2

# Запрос данных у пользователя
x = float(input("Введите значение x: "))
y = float(input("Введите значение y: "))

# Вычисление результата выражения
result = y > x - 2

# Вывод результата
print(f"Результат выражения (y > x - 2): {result}")

